ka2_2024/src/Catalogs/ЭлементыФинансовыхОтчетов/ЭлементыФинансовыхОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭлементыФинансовыхОтчетов</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.ВидыБюджетов</owners>
  <attributes>
    <name>ВидЭлемента</name>
    <type>
      <types>EnumRef.ВидыЭлементовФинансовогоОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <comment>Наименование для печати, представление</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбратныйЗнак</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОтбор</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАналитики</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанныйЭлемент</name>
    <type>
      <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РеквизитыВидаЭлемента</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.РеквизитыЭлементовФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.РеквизитыЭлементовФинансовыхОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОперандыФормулы</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Операнд</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлементыТаблицы</name>
    <attributes>
      <name>Строка</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Колонка</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПоля</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыводитьЗаголовок</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВОтдельнойКолонке</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлементыОформления</name>
    <attributes>
      <name>Оформление</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОформляемойОбласти</name>
      <type>
        <types>EnumRef.ТипыОформляемыхОбластейБюджетныхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОформляемыеСтроки</name>
    <attributes>
      <name>ЭлементОтчета</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОформляемыеКолонки</name>
    <attributes>
      <name>ЭлементОтчета</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасшифровкаПолейОтбораЭО</name>
    <attributes>
      <name>ЭлементОтчета</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючЭлементаОформления</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПоляОтбора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРесурса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсточникиЗначений</name>
    <attributes>
      <name>Источник</name>
      <type>
        <types>CatalogRef.ЭлементыФинансовыхОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавляемыеЗначенияДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ka2_2024/src/CommonModules/ФинансоваяОтчетностьВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

// Помещает данные переданной строки вида отчета во временное хранилище формы.
//
// Параметры:
//  ПомещаемыйОбъект - СправочникОбъект.ЭлементыФинансовыхОтчетов, Структура - помещаемый объект.
//  АдресХранилища - Строка, УникальныйИдентификатор - адрес временного хранилища
//  ОчиститьСсылки - Булево - Если истина тогда ссылка элемента справочника и ссылка владельца отчета будут очищены.
//  					При записи такого элемента отчета будет сформирована новая ссылка т.о. помещаемый элемент
//  					будет скопирован.
//
// Возвращаемое значение:
//   Строка   - Адрес элемента в хранилище.
//
Функция ПоместитьЭлементВХранилище(ПомещаемыйОбъект, АдресХранилища = Неопределено, ОчиститьСсылки = Ложь) Экспорт
	
	СтруктураЭлемента = ДанныеЭлементаОтчета(ПомещаемыйОбъект);
	Если ОчиститьСсылки Тогда
		СтруктураЭлемента.Ссылка = Неопределено;
		СтруктураЭлемента.Владелец = Неопределено;
		
		Операнды = Новый Массив;
		Для Каждого СтрокаОперанда Из СтруктураЭлемента.ОперандыФормулы Цикл
			Если ТипЗнч(СтрокаОперанда.Операнд) = Тип("СправочникСсылка.ЭлементыФинансовыхОтчетов") Тогда
				Операнды.Добавить(СтрокаОперанда.Операнд);
			КонецЕсли;
		КонецЦикла;
		Если Операнды.Количество() = 0 Тогда
			ЗначенияРеквизитов = Неопределено;
		Иначе 
			СвойстваЭлементов  = ФинансоваяОтчетностьКлиентСервер.СтруктураЭлементаОтчета();
			ПолучаемыеЗначения = "";
			Для каждого КлючИЗначение Из СвойстваЭлементов Цикл
				ПолучаемыеЗначения = ПолучаемыеЗначения + ?(ПолучаемыеЗначения = "", "", ", ") + КлючИЗначение.Ключ;
			КонецЦикла; 
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Операнды, ПолучаемыеЗначения);
		КонецЕсли;
		
		Для Каждого СтрокаОперанда Из СтруктураЭлемента.ОперандыФормулы Цикл
			Данные = ДанныеЭлементаОтчета(СтрокаОперанда.Операнд, ЗначенияРеквизитов);
			Данные.Ссылка = Неопределено;
			Данные.Владелец = Неопределено;
			СтрокаОперанда.АдресСтруктурыЭлемента = ПоместитьВоВременноеХранилище(Данные, АдресХранилища);
			СтрокаОперанда.Операнд = Неопределено;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(СтруктураЭлемента, АдресХранилища);
	
КонецФункции

// Помещает данные переданной строки вида отчета во временное хранилище формы без ссылки элемента справочника.
// При записи такого элемента отчета будет сформирована новая ссылка т.о. помещаемый элемент будет скопирован.
//
// Параметры:
//  ПомещаемыйОбъект - Произвольный - помещаемый объект
//  АдресХранилища - Строка - адрес временного хранилища.
//
// Возвращаемое значение:
//   Строка - Адрес элемента в хранилище.
//
Функция ПоместитьКопиюЭлементаВХранилище(ПомещаемыйОбъект, АдресХранилища = Неопределено) Экспорт
	
	Возврат ПоместитьЭлементВХранилище(ПомещаемыйОбъект, АдресХранилища, Истина);
	
КонецФункции

// Возвращает данные элемента отчета
// 
// Параметры:
// 	ЭлементОтчета - СправочникОбъект.ЭлементыФинансовыхОтчетов, Структура - Описание
// 	ЗначенияРеквизитов - Соответствие, Неопределено - Описание:
// * Ключ - СправочникСсылка.ЭлементыФинансовыхОтчетов -
// * Значение - см. ФинансоваяОтчетностьКлиентСервер.СтруктураЭлементаОтчета
// Возвращаемое значение:
// 	Структура, Неопределено, Произвольный - Описание:
// * ИсточникиЗначений - ТаблицаЗначений - описание:
// 		** Источник - СправочникСсылка.ЭлементыФинансовыхОтчетов, Строка - элемент или его адрес во временном хранилище.
// 		** ДобавляемыеЗначенияДокумента - Булево -
// * РасшифровкаПолейОтбораЭО - ТаблицаЗначений - описание:
// 		** ЭлементОтчета - СправочникСсылка.ЭлементыФинансовыхОтчетов, Строка - элемент или его адрес во временном хранилище.
// 		** КлючЭлементаОформления - УникальныйИдентификатор -
// 		** ИмяПоляОтбора - Строка -
// 		** ИмяРесурса - Строка -
// * ОформляемыеКолонки - ТаблицаЗначений - описание:
// 		** ЭлементОтчета - СправочникСсылка.ЭлементыФинансовыхОтчетов, Строка - элемент или его адрес во временном хранилище.
// 		** КлючЭлементаОформления - УникальныйИдентификатор -
// * ОформляемыеСтроки - ТаблицаЗначений - описание:
// 		** ЭлементОтчета - СправочникСсылка.ЭлементыФинансовыхОтчетов, Строка - элемент или его адрес во временном хранилище.
// 		** КлючЭлементаОформления - УникальныйИдентификатор -
// * ЭлементыОформления - ТаблицаЗначений - описание:
// 		** Оформление - ХранилищеЗначения -
// 		** Условие - ХранилищеЗначения -
// 		** ТипОформляемойОбласти - ПеречислениеСсылка.ТипыОформляемыхОбластейБюджетныхОтчетов -
// 		** КлючЭлементаОформления - УникальныйИдентификатор - 
// * ДополнительныеПоля - ТаблицаЗначений - описание:
// 		** Реквизит - Строка -
// 		** Наименование - Строка -
// 		** ВыводитьЗаголовок - Булево -
// 		** ВОтдельнойКолонке - Булево -
// * ЭлементыТаблицы - ТаблицаЗначений -:
// 		** Строка - СправочникСсылка.ЭлементыФинансовыхОтчетов, Строка - элемент или его адрес во временном хранилище.
// 		** Колонка - СправочникСсылка.ЭлементыФинансовыхОтчетов, Строка - элемент или его адрес во временном хранилище.
// 		** Элемент - СправочникСсылка.ЭлементыФинансовыхОтчетов, Строка - элемент или его адрес во временном хранилище.
// * ОперандыФормулы - ТаблицаЗначений - описание:
// 		** Идентификатор - Строка -
// 		** Операнд - СправочникСсылка.ЭлементыФинансовыхОтчетов, Строка - элемент или его адрес во временном хранилище.
// * РеквизитыВидаЭлемента - ТаблицаЗначений - описание:
// 		** Реквизит - ПланВидовХарактеристикСсылка.РеквизитыЭлементовФинансовыхОтчетов -
// 		** Значение - Характеристика.РеквизитыЭлементовФинансовыхОтчетов -
// * СвязанныйЭлемент - СправочникСсылка.ЭлементыФинансовыхОтчетов, Строка - элемент или его адрес во временном хранилище.
// * ЗначениеАналитики -Характеристика.АналитикиСтатейБюджетов -
// * ЕстьНастройки - Булево -
// * ДополнительныйОтбор - ХранилищеЗначения -
// * Комментарий - Строка -
// * ОбратныйЗнак - Булево -
// * НаименованиеДляПечати - Строка -
// * ВидЭлемента - ПеречислениеСсылка.ВидыЭлементовФинансовогоОтчета -
// * Код - Число -
// * Наименование - Строка -
// * Владелец - СправочникСсылка.ВидыФинансовыхОтчетов, СправочникСсылка.ВидыБюджетов -
// * Ссылка - СправочникСсылка.ЭлементыФинансовыхОтчетов, Строка - элемент или его адрес во временном хранилище.
Функция ДанныеЭлементаОтчета(ЭлементОтчета, ЗначенияРеквизитов = Неопределено) Экспорт
	
	СтруктураЭлемента = ФинансоваяОтчетностьКлиентСервер.СтруктураЭлементаОтчета();
	Если ТипЗнч(ЭлементОтчета) = Тип("СправочникОбъект.ЭлементыФинансовыхОтчетов") Тогда
		ЗаполнитьЗначенияСвойств(СтруктураЭлемента, ЭлементОтчета);
		КопироватьТаблицыЭлемента(ЭлементОтчета, СтруктураЭлемента);
	ИначеЕсли ТипЗнч(ЭлементОтчета) = Тип("СправочникСсылка.ЭлементыФинансовыхОтчетов") Тогда
		Если ЗначениеЗаполнено(ЭлементОтчета) Тогда
			НайденноеЗначениеКеша = Неопределено;
			Если ЗначенияРеквизитов <> Неопределено Тогда
				НайденноеЗначениеКеша = ЗначенияРеквизитов.Получить(ЭлементОтчета);
			КонецЕсли;
		КонецЕсли;
		Если НайденноеЗначениеКеша = Неопределено Тогда
			СтруктураЭлемента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
				ЭлементОтчета,
				СтруктураЭлемента); // см. ФинансоваяОтчетностьКлиентСервер.СтруктураЭлементаОтчета
		Иначе
			СтруктураЭлемента = НайденноеЗначениеКеша;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтруктураЭлемента.Ссылка) Тогда
			КопироватьТаблицыЭлемента(СтруктураЭлемента, СтруктураЭлемента);
		КонецЕсли;
	ИначеЕсли ТипЗнч(ЭлементОтчета) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(СтруктураЭлемента, ЭлементОтчета);
		Для Каждого КлючИЗначение Из ЭлементОтчета Цикл
			Если СтрНайти(КлючИЗначение.Ключ, "ДополнительныйРеквизит_") Тогда
				ИмяДополнительногоРеквизита = СтрЗаменить(КлючИЗначение.Ключ, "ДополнительныйРеквизит_", "");
				УстановитьЗначениеДополнительногоРеквизита(СтруктураЭлемента, ИмяДополнительногоРеквизита, КлючИЗначение.Значение)
			КонецЕсли;
		КонецЦикла;
	Иначе
		ВызватьИсключение НСтр("ru = 'Не определен тип помещаемого объекта'");
	КонецЕсли;
	
	СтруктураЭлемента.Вставить("ЭтоСвязанный", ЗначениеЗаполнено(СтруктураЭлемента.СвязанныйЭлемент));
	
	Если ТипЗнч(СтруктураЭлемента.ОперандыФормулы) <> Тип("ТаблицаЗначений") Тогда
		ОперандыФормулы = Новый ТаблицаЗначений;
		ОперандыФормулы.Колонки.Добавить("Идентификатор");
		ОперандыФормулы.Колонки.Добавить("Операнд");
		СтруктураЭлемента.ОперандыФормулы = ОперандыФормулы;
	КонецЕсли;
	Если ТипЗнч(СтруктураЭлемента.РеквизитыВидаЭлемента) <> Тип("ТаблицаЗначений") Тогда
		РеквизитыВидаЭлемента = Новый ТаблицаЗначений;
		РеквизитыВидаЭлемента.Колонки.Добавить("Реквизит");
		РеквизитыВидаЭлемента.Колонки.Добавить("Значение");
		СтруктураЭлемента.РеквизитыВидаЭлемента = РеквизитыВидаЭлемента;
	КонецЕсли;
	Если ТипЗнч(СтруктураЭлемента.ЭлементыТаблицы) <> Тип("ТаблицаЗначений") Тогда
		ЭлементыТаблицы = Новый ТаблицаЗначений;
		ЭлементыТаблицы.Колонки.Добавить("Строка");
		ЭлементыТаблицы.Колонки.Добавить("Колонка");
		ЭлементыТаблицы.Колонки.Добавить("Элемент");
		СтруктураЭлемента.ЭлементыТаблицы = ЭлементыТаблицы;
	КонецЕсли;
	Если ТипЗнч(СтруктураЭлемента.ДополнительныеПоля) <> Тип("ТаблицаЗначений") Тогда
		ДополнительныеПоля = Новый ТаблицаЗначений;
		ДополнительныеПоля.Колонки.Добавить("Реквизит");
		ДополнительныеПоля.Колонки.Добавить("Наименование");
		ДополнительныеПоля.Колонки.Добавить("ВыводитьЗаголовок");
		СтруктураЭлемента.ДополнительныеПоля = ДополнительныеПоля;
	КонецЕсли;
	Если ТипЗнч(СтруктураЭлемента.ЭлементыОформления) <> Тип("ТаблицаЗначений") Тогда
		ЭлементыОформления = Новый ТаблицаЗначений;
		ЭлементыОформления.Колонки.Добавить("Оформление");
		ЭлементыОформления.Колонки.Добавить("Условие");
		ЭлементыОформления.Колонки.Добавить("ТипОформляемойОбласти");
		ЭлементыОформления.Колонки.Добавить("КлючЭлементаОформления");
		СтруктураЭлемента.ЭлементыОформления = ЭлементыОформления;
	КонецЕсли;
	Если ТипЗнч(СтруктураЭлемента.ОформляемыеСтроки) <> Тип("ТаблицаЗначений") Тогда
		ОформляемыеСтроки = Новый ТаблицаЗначений;
		ОформляемыеСтроки.Колонки.Добавить("ЭлементОтчета");
		ОформляемыеСтроки.Колонки.Добавить("КлючЭлементаОформления");
		СтруктураЭлемента.ОформляемыеСтроки = ОформляемыеСтроки;
	КонецЕсли;
	Если ТипЗнч(СтруктураЭлемента.ОформляемыеКолонки) <> Тип("ТаблицаЗначений") Тогда
		ОформляемыеКолонки = Новый ТаблицаЗначений;
		ОформляемыеКолонки.Колонки.Добавить("ЭлементОтчета");
		ОформляемыеКолонки.Колонки.Добавить("КлючЭлементаОформления");
		СтруктураЭлемента.ОформляемыеКолонки = ОформляемыеКолонки;
	КонецЕсли;
	Если ТипЗнч(СтруктураЭлемента.РасшифровкаПолейОтбораЭО) <> Тип("ТаблицаЗначений") Тогда
		РасшифровкаПолейОтбораЭО = Новый ТаблицаЗначений;
		РасшифровкаПолейОтбораЭО.Колонки.Добавить("КлючЭлементаОформления");
		РасшифровкаПолейОтбораЭО.Колонки.Добавить("ЭлементОтчета");
		РасшифровкаПолейОтбораЭО.Колонки.Добавить("ИмяПоляОтбора");
		РасшифровкаПолейОтбораЭО.Колонки.Добавить("ИмяРесурса");
		СтруктураЭлемента.РасшифровкаПолейОтбораЭО = РасшифровкаПолейОтбораЭО;
	КонецЕсли;
	Если ТипЗнч(СтруктураЭлемента.ИсточникиЗначений) <> Тип("ТаблицаЗначений") Тогда
		ИсточникиЗначений = Новый ТаблицаЗначений;
		ИсточникиЗначений.Колонки.Добавить("Источник");
		ИсточникиЗначений.Колонки.Добавить("ДобавляемыеЗначенияДокумента");
		СтруктураЭлемента.ИсточникиЗначений = ИсточникиЗначений;
	КонецЕсли;
	
	ОперандыФормулы = СтруктураЭлемента.ОперандыФормулы; // ТаблицаЗначений
	Если ОперандыФормулы.Колонки.Найти("АдресСтруктурыЭлемента") = Неопределено Тогда
		ОперандыФормулы.Колонки.Добавить("АдресСтруктурыЭлемента");
	КонецЕсли;
	
	Возврат СтруктураЭлемента;
	
КонецФункции

// Процедура устанавливает значение дополнительного реквизита элемента финансового отчета.
//
// Параметры:
//  Источник - Произвольный - объект или адрес структуры элемента в хранилище
//  Реквизит - Строка, ПланВидовХарактеристикСсылка.РеквизитыЭлементовФинансовыхОтчетов - имя реквизита
//  Значение - Произвольный - значение реквизита.
//
Процедура УстановитьЗначениеДополнительногоРеквизита(Источник, Знач Реквизит, Значение) Экспорт
	
	Если ТипЗнч(Источник) = Тип("Строка") Тогда
		Объект = ПолучитьИзВременногоХранилища(Источник);
	Иначе
		Объект = Источник;
	КонецЕсли;
	
	Если Объект.РеквизитыВидаЭлемента = Неопределено Тогда
		ТаблицаРеквизитов = Новый ТаблицаЗначений;
		ТаблицаРеквизитов.Колонки.Добавить("Реквизит");
		ТаблицаРеквизитов.Колонки.Добавить("Значение");
		ТаблицаРеквизитов.Индексы.Добавить("Реквизит");
		Объект.РеквизитыВидаЭлемента = ТаблицаРеквизитов;
	КонецЕсли;
	
	Если ТипЗнч(Реквизит) = Тип("Строка") Тогда
		Реквизит = ПланыВидовХарактеристик.РеквизитыЭлементовФинансовыхОтчетов[Реквизит];
	КонецЕсли;
	
	НайденнаяСтрока = Объект.РеквизитыВидаЭлемента.Найти(Реквизит);
	Если НайденнаяСтрока = Неопределено Тогда
		НайденнаяСтрока = Объект.РеквизитыВидаЭлемента.Добавить();
		НайденнаяСтрока.Реквизит = Реквизит;
	КонецЕсли;
	
	НайденнаяСтрока.Значение = Значение;
	
	Если НайденнаяСтрока.Значение = Неопределено Тогда
		Объект.РеквизитыВидаЭлемента.Удалить(НайденнаяСтрока);
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("Строка") Тогда
		ПоместитьВоВременноеХранилище(Объект, Источник);
	КонецЕсли;
	
КонецПроцедуры

// Процедура устанавливает значение дополнительного реквизита элемента финансового отчета.
//
// Параметры:
//  Источник - Произвольный - объект или адрес структуры элемента в хранилище
//  Реквизиты - Структура - реквизиты для установки.
//
Процедура УстановитьЗначенияДополнительныхРеквизитов(Источник, Реквизиты) Экспорт
	
	Для Каждого КлючИЗначение Из Реквизиты Цикл
		УстановитьЗначениеДополнительногоРеквизита(Источник, КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
КонецПроцедуры

// Процедура устанавливает значение реквизита элемента финансового отчета в хранилище.
//
// Параметры:
//  АдресХранилища - Строка - адрес структуры элемента
//  СтруктураЗначений - Структура - реквизиты для установки.
//
Процедура УстановитьЗначениеРеквизита(АдресХранилища, СтруктураЗначений) Экспорт
	
	Объект = ПолучитьИзВременногоХранилища(АдресХранилища);
	Для Каждого КлючИЗначение Из СтруктураЗначений Цикл
		Объект[КлючИЗначение.Ключ] = Неопределено;
	КонецЦикла;
	ПоместитьВоВременноеХранилище(Объект, АдресХранилища);
	
КонецПроцедуры

// Функция возвращает значения дополнительных реквизитов элемента финансового отчета.
//
// Параметры:
//  СсылкаНаЭлемент - СправочникОбъект.ЭлементыФинансовыхОтчетов, СправочникСсылка.ЭлементыФинансовыхОтчетов, Структура, Строка -
//                    объект или адрес структуры элемента в хранилище.
//  Реквизиты - Структура - реквизиты для получения.
//
// Возвращаемое значение:
//   Структура - значение дополнительного реквизита.
//
Функция ЗначенияДополнительныхРеквизитов(СсылкаНаЭлемент, Реквизиты) Экспорт
	
	Если ТипЗнч(СсылкаНаЭлемент) = Тип("Строка") Тогда
		Объект = ПолучитьИзВременногоХранилища(СсылкаНаЭлемент); // см. ДанныеЭлементаОтчета
		Кэш    = Объект.РеквизитыВидаЭлемента;
	ИначеЕсли ТипЗнч(СсылкаНаЭлемент) = Тип("СправочникСсылка.ЭлементыФинансовыхОтчетов") Тогда
		Объект = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаЭлемент, "РеквизитыВидаЭлемента");
		Кэш    = Объект.РеквизитыВидаЭлемента.Выгрузить();
	Иначе
		Кэш = СсылкаНаЭлемент.РеквизитыВидаЭлемента;
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура(Реквизиты);
	
	Результат = Новый Структура;
	
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		Результат.Вставить(КлючИЗначение.Ключ, 
									ФинансоваяОтчетностьСервер.ЗначениеДополнительногоРеквизита(
										Неопределено, 
										ПланыВидовХарактеристик.РеквизитыЭлементовФинансовыхОтчетов[КлючИЗначение.Ключ],
										Кэш));
	КонецЦикла;
		
	Возврат Результат;
	
КонецФункции

// Функция возвращает значение дополнительного реквизита элемента финансового отчета.
//
// Параметры:
//  СсылкаНаЭлемент - Произвольный - объект или адрес структуры элемента в хранилище
//  Реквизит - строка - реквизит для получения.
//
// Возвращаемое значение:
//   Произвольный   - значение дополнительного реквизита.
//
Функция ЗначениеДополнительногоРеквизита(СсылкаНаЭлемент, Реквизит) Экспорт
	
	Возврат ЗначенияДополнительныхРеквизитов(СсылкаНаЭлемент, Реквизит)[Реквизит];
	
КонецФункции

// Функция определяет имя формы элемента справочника для редактирования элемента финансового отчета.
//
// Параметры:
//  ВидЭлемента - ПеречислениеСсылка.ВидыЭлементовФинансовогоОтчета - вид элемента для которого необходимо определить форму
//  Элемент - Строка - адрес во временном хранилище по которому расположены все данные элемента
//  ДополнительныйРежим - ПеречислениеСсылка.ДополнительныеРежимыЭлементовОтчетов - признак дополнительного режима формы.
//  ОткрытиеФормыЭлементаБюджетногоОтчета - Булево - флаг открытия формы бюджетного отчета, заполняется только при отрытии формы.
//
// Возвращаемое значение:
//   Структура - Структура с параметрами:
//    *ИмяФормы - Строка - Имя формы справочника.
//    *Реквизиты - Структура - Структура реквизитов.
//
Функция ПараметрыИспользованияФормы(ВидЭлемента, Элемент, ДополнительныйРежим = Неопределено, ОткрытиеФормыЭлементаБюджетногоОтчета = Ложь) Экспорт
	
	ДопРежимы = Перечисления.ДополнительныеРежимыЭлементовОтчетов;
	ТипыИзмерений = Перечисления.ТипыИзмеренийФинансовогоОтчета;
	
	МассивДополнительныхРеквизитов = Новый Массив;
	ДополнительныеРеквизиты = ПланыВидовХарактеристик.РеквизитыЭлементовФинансовыхОтчетов;
	ИмяФормыЭлемента = Неопределено;
	Если ДополнительныйРежим = ДопРежимы["СвязанныйЭлемент"] Тогда
		ИмяФормыЭлемента = "Форма.ФормаСвязанногоЭлемента";
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.КодСтрокиОтчета);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.Примечание);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ВыделитьЭлемент);
	ИначеЕсли ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.ЗаголовокОтчета
		ИЛИ ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.НередактируемыйТекст
		ИЛИ ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.РедактируемыйТекст Тогда
		ИмяФормыЭлемента = "Форма.ТекстовыйБлок";
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.Текст);
		Если ЭтоАдресВременногоХранилища(Элемент) Тогда
			ПараметрыЭлемента = ПолучитьИзВременногоХранилища(Элемент);
			ВладелецЭлемента = ?(ПараметрыЭлемента.Свойство("Владелец"), ПараметрыЭлемента.Владелец, Неопределено);
		Иначе
			ВладелецЭлемента = Элемент.Владелец;
		КонецЕсли;
		Если ТипЗнч(ВладелецЭлемента) = Тип("СправочникСсылка.ВидыБюджетов") Тогда
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ТолькоДляПечати);
		КонецЕсли;
		Если ОткрытиеФормыЭлементаБюджетногоОтчета Тогда
			ИмяФормыЭлемента = "Форма.ТекстовыйБлокБюджетов";
		КонецЕсли;
	ИначеЕсли ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.НефинансовыйПоказатель Тогда
		ИмяФормыЭлемента = "Форма.НефинансовыйПоказатель";
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ПериодСмещения);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ПериодичностьСмещения);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.НефинансовыйПоказатель);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ИспользоватьФильтрПоОрганизации);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ИспользоватьФильтрПоПодразделению);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ИспользоватьФильтрПоСценарию);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ПривилегированныйРежим);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ВыражениеПредставления);
		
	ИначеЕсли ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.СтатьяБюджетов
		ИЛИ ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.ВсеСтатьиБюджетов Тогда
		Если ДополнительныйРежим = ДопРежимы["СтатьяБюджетовВРежимеВвода"] Тогда
			ИмяФормыЭлемента = "Форма.СтатьяБюджетовДляВвода";
		ИначеЕсли ДополнительныйРежим = ДопРежимы["ВсеСтатьиВСложнойТаблице"]
			ИЛИ ДополнительныйРежим = ДопРежимы["СтатьяВПоказателеБюджетов"] Тогда
			ИмяФормыЭлемента = "Форма.СтатьяБюджетовБезНастроек";
		Иначе
			ИмяФормыЭлемента = "Форма.СтатьяБюджетов";
		КонецЕсли;
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.СтатьяБюджетов);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ВыводимыеПоказатели);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ПривилегированныйРежим);
		Если ИмяФормыЭлемента = "Форма.СтатьяБюджетов" Тогда
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ИсключитьДанныеВводимогоДокументаПриРасчете);
		КонецЕсли;
		//фильтры
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ИспользоватьФильтрПоОрганизации);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ИспользоватьФильтрПоПодразделению);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ИспользоватьФильтрПоСценарию);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ИспользоватьФильтрПоСтатусу);
		//заполнение
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.СпособЗаполнения);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.Формула);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ВыражениеПредставления);
		// периоды данных
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ПериодСмещения);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ПериодичностьСмещения);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.НижняяГраницаДанных);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ВерхняяГраницаДанных);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.НачалоПериодаГруппировки);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.КонецПериодаГруппировки);
		
	ИначеЕсли ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.ПоказательБюджетов
		ИЛИ ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.ВсеПоказателиБюджетов Тогда
		Если ДополнительныйРежим = ДопРежимы["ВсеПоказателиВСложнойТаблице"] Тогда
			ИмяФормыЭлемента = "Форма.ВсеПоказателиСложнаяТаблица";
		Иначе
			ИмяФормыЭлемента = "Форма.ПоказательБюджетов";
		КонецЕсли;
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ПоказательБюджетов);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ВыводимыеПоказатели);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ТипЗначенияПоказателя);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ПривилегированныйРежим);
		Если ИмяФормыЭлемента = "Форма.ПоказательБюджетов" Тогда
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ИсключитьДанныеВводимогоДокументаПриРасчете);
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ВыражениеПредставления);
		КонецЕсли;
		//фильтры
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ИспользоватьФильтрПоОрганизации);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ИспользоватьФильтрПоПодразделению);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ИспользоватьФильтрПоСценарию);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ИспользоватьФильтрПоСтатусу);
		// периоды данных
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ПериодСмещения);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ПериодичностьСмещения);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.НижняяГраницаДанных);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ВерхняяГраницаДанных);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.НачалоПериодаГруппировки);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.КонецПериодаГруппировки);
		
	ИначеЕсли (ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.Группа
		ИЛИ ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.ИтогПоГруппе) Тогда
		Если ДополнительныйРежим = ДопРежимы["ПоказатьКодСтрокиПримечание"] Тогда
			ИмяФормыЭлемента = "Форма.Группа";
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ВыводитьЗаголовокЭлемента);
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.КодСтрокиОтчета);
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.Примечание);
		Иначе
			ИмяФормыЭлемента = "Форма.Группа";
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ВыводитьЗаголовокЭлемента);
		КонецЕсли;
		Если  ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.ИтогПоГруппе Тогда
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.Точность);
		КонецЕсли;
	ИначеЕсли ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.ТаблицаСложная
		ИЛИ ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.ТаблицаПоказателиВКолонках
		ИЛИ ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.ТаблицаПоказателиВСтроках Тогда
		ИмяФормыЭлемента = "Форма.Таблица";
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ВыводитьЗаголовокЭлемента);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ВыводитьЗаголовокГруппировки);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ЗаголовокГруппировки);
	ИначеЕсли ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.ФормулаПоГруппе Тогда
		ИмяФормыЭлемента = "Форма.ФормулаПоГруппе";
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ФормулаПоГруппе);
	ИначеЕсли ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.ЭлементТаблицы Тогда
		ИмяФормыЭлемента = "Форма.ЭлементТаблицы";
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.КодСтрокиОтчета);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.Примечание);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ВыделитьЭлемент);
	ИначеЕсли ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.МонетарныйПоказатель Тогда
		ИмяФормыЭлемента = "Форма.МонетарныйПоказатель";
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.СчетПланаСчетов);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ТипИтога);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.НачальноеСальдо);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.КодСтрокиОтчета);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.Примечание);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ВыделитьЭлемент);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.Точность);
		
	ИначеЕсли ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.НемонетарныйПоказатель Тогда
		ИмяФормыЭлемента = "Форма.НемонетарныйПоказатель";
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.НемонетарныйПоказатель);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.КодСтрокиОтчета);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.Примечание);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ВыделитьЭлемент);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.Точность);
		
	ИначеЕсли ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.ПроизводныйПоказатель Тогда
		Если ДополнительныйРежим = ДопРежимы["ВидОтчета"] Тогда
			ИмяФормыЭлемента = "Форма.ПроизводныйПоказательОтчета";
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.Формула);
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.КодСтрокиОтчета);
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.Примечание);
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ВыделитьЭлемент);
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.Точность);
		Иначе
			ИмяФормыЭлемента = "Форма.ПроизводныйПоказательБюджета";
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.Формула);
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ПривилегированныйРежим);
		КонецЕсли;
	ИначеЕсли ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.НастройкаЯчеек Тогда
		Если ДополнительныйРежим = ДопРежимы["ВидОтчета"] Тогда
			ИмяФормыЭлемента = "Форма.НастройкаЯчеекВидаОтчета";
		Иначе
			ИмяФормыЭлемента = "Форма.НастройкаЯчеек";
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ОтображатьНумерациюКолонок);
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ОтображатьНумерациюСтрок);
		КонецЕсли;
	ИначеЕсли ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.ЯчейкаТаблицы Тогда
		ИмяФормыЭлемента = "Форма.ВыборЯчейкиСложнойТаблицы";
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.СтрокаЯчейки);
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.КолонкаЯчейки);
	ИначеЕсли ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.Измерение Тогда
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ТипИзмерения);
		ТипИзмерения = ЗначениеДополнительногоРеквизита(Элемент, "ТипИзмерения");
		Если ТипИзмерения = ТипыИзмерений["Период"] Тогда
			Если ДополнительныйРежим = ДопРежимы["ВидОтчета"] Тогда
				ИмяФормыЭлемента = "Форма.ПериодВидаОтчета";
				МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.Периодичность);
				МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.Сортировка);
				МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ПредставлениеПериода);
				МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ВыводитьПоказателиАналогичныхПериодовПрошлыхЛет);
				МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ВыводитьПоказателиПредыдущихПериодов);
				МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.КоличествоПредыдущихЛет);
				МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.КоличествоПредыдущихПериодов);
			Иначе
				ИмяФормыЭлемента = "Форма.Период";
				МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.Периодичность);
				МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ЗначениеПериода);
			КонецЕсли;
		ИначеЕсли ТипИзмерения = ТипыИзмерений["ИзмерениеРегистра"]
			ИЛИ ТипИзмерения = ТипыИзмерений["ИзмерениеРегистраБухгалтерии"] Тогда
			ИмяФормыЭлемента = "Форма.ИзмерениеРегистра";
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ИмяИзмерения);
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.Точность);
			Если Не ТипИзмерения = ТипыИзмерений["ИзмерениеРегистраБухгалтерии"] Тогда
				МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ВыбранныеИсточникиЗначений);
			КонецЕсли;
		ИначеЕсли ТипИзмерения = ТипыИзмерений["Субконто"] Тогда
			ИмяФормыЭлемента = "Форма.ИзмерениеРегистра";
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ВидСубконто);
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.Точность);
		ИначеЕсли ТипИзмерения = ТипыИзмерений["Аналитика"] Тогда
			ИмяФормыЭлемента = "Форма.ВидАналитики";
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ВидАналитики);
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ВыбранныеИсточникиЗначений);
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ИсточникВсеЭлементы);
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ВыводитьИерархиюЭлементов);
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ВыражениеПредставления);
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ВыражениеСортировки);
		ИначеЕсли ТипИзмерения = ТипыИзмерений["Сценарий"] Тогда
			ИмяФормыЭлемента = "Форма.Сценарий";
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.Сценарий);
		ИначеЕсли ТипИзмерения = ТипыИзмерений["Организация"] Тогда
			ИмяФормыЭлемента = "Форма.Организация";
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.Организация);
		ИначеЕсли ТипИзмерения = ТипыИзмерений["Подразделение"] Тогда
			ИмяФормыЭлемента = "Форма.Подразделение";
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.Подразделение);
		ИначеЕсли ТипИзмерения = ТипыИзмерений["Валюта"] Тогда
			ИмяФормыЭлемента = "Форма.Валюта";
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.Валюта);
		ИначеЕсли ТипИзмерения = ТипыИзмерений["ФиксированнаяАналитика"] Тогда
			ИмяФормыЭлемента = "Форма.ФиксированнаяАналитика";
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ЭтоАналитикаПрочее);
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.РазрешитьРедактирование);
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ВидАналитики);
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ВыбранныеИсточникиЗначений);
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ИсточникВсеЭлементы);
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ВыводитьИерархиюЭлементов);
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ВыражениеПредставления);
			МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ВыражениеСортировки);
		КонецЕсли;
	ИначеЕсли ВидЭлемента = Перечисления.ВидыЭлементовФинансовогоОтчета.РедактируемоеЗначение Тогда
		ИмяФормыЭлемента = "Форма.РедактируемоеЗначение";
		МассивДополнительныхРеквизитов.Добавить(ДополнительныеРеквизиты.ТипРедактируемогоЗначения);
	КонецЕсли;
	
	Если ИмяФормыЭлемента = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Неизвестный вид элемента отчета'");
	КонецЕсли;
	
	ИменаДополнительныхРеквизитов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивДополнительныхРеквизитов, "ИмяПредопределенныхДанных");
	СтруктураДополнительныхРеквизитов = Новый Структура;
	Для Каждого ИмяДопРеквизита Из ИменаДополнительныхРеквизитов Цикл
		СтруктураДополнительныхРеквизитов.Вставить(ИмяДопРеквизита.Значение);
	КонецЦикла;
	
	Возврат Новый Структура(
				"ИмяФормы, Реквизиты",
				"Справочник.ЭлементыФинансовыхОтчетов." + ИмяФормыЭлемента,
				СтруктураДополнительныхРеквизитов);
	
КонецФункции

// Возвращает имя значения перечисления Периодичность
//
// Параметры:
// 	Периодичность - ПеречислениеСсылка.Периодичность - значение периодичности.
// 	              - Неопределено - если значение периодичности не задано.
//
// Возвращаемое значение:
// 	Строка - Имя перечисления перечисления периодичности,
// 	         пустая строка, если значение периодичности не задано.
//
Функция ПериодичностьСтрокой(Периодичность) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Периодичность) Тогда
		Результат = "";
	Иначе
		Результат = ОбщегоНазначения.ИмяЗначенияПеречисления(Периодичность);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция возвращает индекс картинки по виду элемента и уточняющей информации
//
// Параметры:
//  ВидЭлемента  - ПеречислениеСсылка.ВидыЭлементовФинансовогоОтчета - Вид элемента, для которого получаем параметр
//  ИмяВспомогательныхДанных  - Строка - уточняющее значение.
//
// Возвращаемое значение:
//   Число   - индекс картинки из коллекции КоллекцияВидыЭлементовФинансовойОтчетности.
//
Функция НестандартнаяКартинка(ВидЭлемента, ИмяВспомогательныхДанных = Неопределено) Экспорт
	
	Возврат ФинансоваяОтчетностьПовтИсп.НестандартнаяКартинка(ВидЭлемента, ИмяВспомогательныхДанных);
	
КонецФункции

// Возвращает значение реквизита, прочитанного из информационной базы или хранилища по ссылке на объект.
// 
// Параметры:
//  Ссылка       - СправочникСсылка, Строка -
//                 ссылка на объект, строка - элемент справочника, документ или адрес элемента в хранилище
//  ИмяРеквизита - Строка - например, "Код".
// 
// Возвращаемое значение:
//  Произвольный    - зависит от типа значения прочитанного реквизита.
// 
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита) Экспорт
	
	Если ТипЗнч(Ссылка) = Тип("Строка") Тогда
		СтруктураЭлемента = ПолучитьИзВременногоХранилища(Ссылка);
		Возврат СтруктураЭлемента[ИмяРеквизита];
	Иначе
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
	КонецЕсли;
	
КонецФункции

// Функция возвращает дерево операторов конструктора формул
//
// Параметры:
//  УсловиеДляЗапроса - Булево - признак, что оператор "условие" следует вернуть в формате для запроса.
//
// Возвращаемое значение:
//   ДеревоЗначений   - дерево операторов.
//
Функция ПостроитьДеревоОператоров(УсловиеДляЗапроса = Истина) Экспорт
	
	Дерево = РаботаСФормулами.ПолучитьПустоеДеревоОператоров();
	
	ПредставлениеГруппыОператора = НСтр("ru='Операторы'");
	ГруппаОператоров = РаботаСФормулами.ДобавитьГруппуОператоров(Дерево, "Операторы", ПредставлениеГруппыОператора);
	
	РаботаСФормулами.ДобавитьОператор(ГруппаОператоров, "+", " + ", "+");
	РаботаСФормулами.ДобавитьОператор(ГруппаОператоров, "-", " - ", "-");
	РаботаСФормулами.ДобавитьОператор(ГруппаОператоров, "*", " * ", "*");
	РаботаСФормулами.ДобавитьОператор(ГруппаОператоров, "/", " / ", "/");
	
	ПредставлениеГруппыОператора = НСтр("ru='Логические операторы и константы'");
	ГруппаОператоров = РаботаСФормулами.ДобавитьГруппуОператоров(Дерево, "ЛогическиеОператорыИКонстанты", ПредставлениеГруппыОператора);
	
	РаботаСФормулами.ДобавитьОператор(ГруппаОператоров, "<", " < ", "<");
	РаботаСФормулами.ДобавитьОператор(ГруппаОператоров, ">", " > ", ">");
	РаботаСФормулами.ДобавитьОператор(ГруппаОператоров, "<=", " <= ", "<=");
	РаботаСФормулами.ДобавитьОператор(ГруппаОператоров, ">=", " >= ", ">=");
	РаботаСФормулами.ДобавитьОператор(ГруппаОператоров, "=", " = ", "=");
	РаботаСФормулами.ДобавитьОператор(ГруппаОператоров, "<>", " <> ", "<>");
	
	ИдентификаторОператора = "И";
	ПредставлениеОператора = НСтр("ru='И'");
	ОператорНаЯзыкеКодаДляВставки = " " + ИдентификаторОператора + " ";
	РаботаСФормулами.ДобавитьОператор(ГруппаОператоров,
		ИдентификаторОператора,
		ОператорНаЯзыкеКодаДляВставки,
		ПредставлениеОператора);
	
	ИдентификаторОператора = "ИЛИ";
	ПредставлениеОператора = НСтр("ru='ИЛИ'");
	ОператорНаЯзыкеКодаДляВставки = " " + ИдентификаторОператора + " ";
	РаботаСФормулами.ДобавитьОператор(ГруппаОператоров,
		ИдентификаторОператора,
		ОператорНаЯзыкеКодаДляВставки,
		ПредставлениеОператора);
	
	ИдентификаторОператора = "НЕ";
	ПредставлениеОператора = НСтр("ru='НЕ'");
	ОператорНаЯзыкеКодаДляВставки = " " + ИдентификаторОператора + " ";
	РаботаСФормулами.ДобавитьОператор(ГруппаОператоров,
		ИдентификаторОператора,
		ОператорНаЯзыкеКодаДляВставки,
		ПредставлениеОператора);
	
	ИдентификаторОператора = "ИСТИНА";
	ПредставлениеОператора = НСтр("ru='ИСТИНА'");
	ОператорНаЯзыкеКодаДляВставки = " " + ИдентификаторОператора + " ";
	РаботаСФормулами.ДобавитьОператор(ГруппаОператоров,
		ИдентификаторОператора,
		ОператорНаЯзыкеКодаДляВставки,
		ПредставлениеОператора);
	
	ИдентификаторОператора = "ЛОЖЬ";
	ПредставлениеОператора = НСтр("ru='ЛОЖЬ'");
	ОператорНаЯзыкеКодаДляВставки = " " + ИдентификаторОператора + " ";
	РаботаСФормулами.ДобавитьОператор(ГруппаОператоров,
		ИдентификаторОператора,
		ОператорНаЯзыкеКодаДляВставки,
		ПредставлениеОператора);
	
	
	ПредставлениеГруппыОператора = НСтр("ru='Функции'");
	ГруппаОператоров = РаботаСФормулами.ДобавитьГруппуОператоров(Дерево, "Функции", ПредставлениеГруппыОператора);
	
	Если УсловиеДляЗапроса Тогда
		ИдентификаторОператора = "ВЫБОР КОГДА ТОГДА ИНАЧЕ КОНЕЦ";
		ПредставлениеОператора = НСтр("ru='Условие'");
		ОператорНаЯзыкеКодаДляВставки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"ВЫБОР КОГДА %1 ТОГДА %2 ИНАЧЕ %3 КОНЕЦ",
			НСтр("ru = '<Условие>'"),
			СтрШаблон(НСтр("ru = '<%1>'"), "РезультатИстина"),
			СтрШаблон(НСтр("ru = '<%1>'"), "РезультатЛожь'"));
		РаботаСФормулами.ДобавитьОператор(ГруппаОператоров,
			ИдентификаторОператора,
			ОператорНаЯзыкеКодаДляВставки,
			ПредставлениеОператора,,
			3);
	Иначе
		ИдентификаторОператора = "?";
		ПредставлениеОператора = НСтр("ru='Условие'");
		ТекстУсловие = НСтр("ru='<Условие>'");
		ТекстЗначениеИстина = НСтр("ru='<Значение если истина>'");
		ТекстЗначениеЛожь = НСтр("ru='<Значение если ложь>'");
		ОператорНаЯзыкеКодаДляВставки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"?(%1, %2, %3)",
			ТекстУсловие,
			ТекстЗначениеИстина,
			ТекстЗначениеЛожь);
		ПояснениеОператора            = НСтр("ru='Вычисляет значение в зависимости от значения условия'");
		РаботаСФормулами.ДобавитьОператор(ГруппаОператоров,
			ИдентификаторОператора,
			ОператорНаЯзыкеКодаДляВставки,
			ПредставлениеОператора,
			ПояснениеОператора,
			3);
	КонецЕсли;
	
	Возврат Дерево;
	
КонецФункции

// Функция копирует элемент, находящийся в хранилище
//
// Параметры:
//  АдресЭлемента - Строка - адрес элемента в хранилище
//  ИдентификаторХранилища - УникальныйИдентификатор - УИД формы, в рамках которой ведется работа
//  ВидЭлемента - Неопределено - в параметр функция вернет вид элемента.
//
// Возвращаемое значение:
//   Строка   - Адрес нового элемента.
//
Функция СкопироватьЭлементПоАдресу(АдресЭлемента, ИдентификаторХранилища, ВидЭлемента = Неопределено) Экспорт
	
	КопияЭлемента = ФинансоваяОтчетностьКлиентСервер.СтруктураЭлементаОтчета();
	ДанныеЭлемента = ПолучитьИзВременногоХранилища(АдресЭлемента);
	ЗаполнитьЗначенияСвойств(КопияЭлемента, ДанныеЭлемента);
	КопияЭлемента.Ссылка = Неопределено;
	
	КопияЭлемента.РеквизитыВидаЭлемента = ДанныеЭлемента.РеквизитыВидаЭлемента.Скопировать();
	КопияЭлемента.ОперандыФормулы = ДанныеЭлемента.ОперандыФормулы.Скопировать();
	КопияЭлемента.ДополнительныеПоля = ДанныеЭлемента.ДополнительныеПоля.Скопировать();
	
	Для Каждого СтрокаОперанда Из КопияЭлемента.ОперандыФормулы Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаОперанда.АдресСтруктурыЭлемента) Тогда
			СтрокаОперанда.АдресСтруктурыЭлемента = ПоместитьЭлементВХранилище(СтрокаОперанда.Операнд, ИдентификаторХранилища);
		КонецЕсли;
		АдресОперанда = СкопироватьЭлементПоАдресу(СтрокаОперанда.АдресСтруктурыЭлемента, ИдентификаторХранилища);
		СтрокаОперанда.АдресСтруктурыЭлемента = АдресОперанда;
		СтрокаОперанда.Операнд = Неопределено; // операнд должен быть создан новый
	КонецЦикла;
	
	ВидЭлемента = КопияЭлемента.ВидЭлемента;
	
	Возврат ПоместитьВоВременноеХранилище(КопияЭлемента, ИдентификаторХранилища);
	
КонецФункции

Процедура КопироватьТаблицыЭлемента(Источник, Приемник)
	
	Приемник.Вставить("ОперандыФормулы",			Источник.ОперандыФормулы.Выгрузить());
	Приемник.Вставить("РеквизитыВидаЭлемента",		Источник.РеквизитыВидаЭлемента.Выгрузить());
	Приемник.Вставить("ЭлементыТаблицы",			Источник.ЭлементыТаблицы.Выгрузить());
	Приемник.Вставить("ДополнительныеПоля",			Источник.ДополнительныеПоля.Выгрузить());
	Приемник.Вставить("ЭлементыОформления",			Источник.ЭлементыОформления.Выгрузить());
	Приемник.Вставить("ОформляемыеСтроки",			Источник.ОформляемыеСтроки.Выгрузить());
	Приемник.Вставить("ОформляемыеКолонки",			Источник.ОформляемыеКолонки.Выгрузить());
	Приемник.Вставить("РасшифровкаПолейОтбораЭО",	Источник.РасшифровкаПолейОтбораЭО.Выгрузить());
	Приемник.Вставить("ИсточникиЗначений",			Источник.ИсточникиЗначений.Выгрузить());
	ПереопределитьТипКолонокТаблицКэша(Приемник);
	
КонецПроцедуры

Процедура ПереопределитьТипКолонокТаблицКэша(СтруктураЭлемента)
	
	СтруктураТаблиц = Новый Структура("ОперандыФормулы, РеквизитыВидаЭлемента, ЭлементыТаблицы, 
										|ОформляемыеСтроки, ОформляемыеКолонки, РасшифровкаПолейОтбораЭО, ИсточникиЗначений");
	
	Для Каждого КлючИЗначение Из СтруктураТаблиц Цикл
		
		Таблица = СтруктураЭлемента[КлючИЗначение.Ключ]; // ТаблицаЗначений
		НоваяТаблица = Новый ТаблицаЗначений;
		Для Каждого Колонка Из Таблица.Колонки Цикл
			НоваяТаблица.Колонки.Добавить(Колонка.Имя);
		КонецЦикла;
		
		СтруктураЭлемента[КлючИЗначение.Ключ] = НоваяТаблица; 
		
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Таблица, СтруктураЭлемента[КлючИЗначение.Ключ]);
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает текст ошибки проверки выражения или представления для аналитики бюджетного отчета
//
// Параметры:
//  ТекстВыражения - Строка - исходный текст выражения, сформированный конструктором формул
//  Источник - Строка, ПланВидовХарактеристикСсылка.АналитикиСтатейБюджетов, СправочникСсылка.СтатьиБюджетов, СправочникСсылка.ПоказателиБюджетов, СправочникСсылка.НефинансовыеПоказателиБюджетов - аналитика бюджетного отчета
//  НаименованиеДляПечати - Строка - текущее представление статьи, показателя или НФП бюджетов
//
// Возвращаемое значение:
//  Строка - текст ошибки (если проверка пройдена удачно, то пустая строка)
//
Функция ТекстОшибкиВыраженияПредставленияСортировки(ТекстВыражения, Источник, НаименованиеДляПечати) Экспорт
	
	ПараметрыЗапроса = Новый Структура;
	Если ТипЗнч(Источник) = Тип("ПланВидовХарактеристикСсылка.АналитикиСтатейБюджетов") Тогда
		ИмяИсточника = ФинансоваяОтчетностьПовтИсп.ИмяПоляБюджетногоОтчета(Источник);
		ОписаниеТиповИсточника = ФинансоваяОтчетностьПовтИсп.ТипЗначенияВидаАналитики(ИмяИсточника, Источник);
	ИначеЕсли ТипЗнч(Источник) = Тип("Строка") Тогда
		ИмяИсточника = Источник;
		ОписаниеТиповИсточника = ФинансоваяОтчетностьПовтИсп.ТипЗначенияВидаАналитики(ИмяИсточника, Источник);
	Иначе
		
		ИмяИсточника = Источник.Метаданные().Имя;
		ОписаниеТиповИсточника = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипЗнч(Источник)));
		ПараметрыЗапроса.Вставить("Источник", Источник);
	КонецЕсли;
	
	ТекстВыраженияСПсевдонимом = ФинансоваяОтчетностьПовтИсп.ТекстВыраженияПредставленияСортировкиСИменемИзмерения(
		ТекстВыражения, ИмяИсточника);
	
	ШаблонЗапроса = "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	&ТекстВыраженияСПсевдонимом
		|ИЗ
		|	&ИмяТаблицыДанных КАК ИмяИсточника
		|ГДЕ
		|	&ТекстУсловия";
	
	ТекстыЗапросов = Новый Массив;
	Для Каждого Тип Из ОписаниеТиповИсточника.Типы() Цикл
		ИмяТаблицыДанных = РаботаСФормуламиПовтИсп.ПолноеИмяТаблицыДанных(Метаданные.НайтиПоТипу(Тип).ПолноеИмя());
		Если ПараметрыЗапроса.Свойство("Источник") Тогда
			ТекстУсловия = ИмяИсточника + ".Ссылка = &Источник"; // @query-part
		Иначе
			ТекстУсловия = "ИСТИНА"; // @query-part
		КонецЕсли;
		ТекстЗапроса = СтрЗаменить(ШаблонЗапроса, "&ИмяТаблицыДанных", ИмяТаблицыДанных);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяИсточника", ИмяИсточника);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстВыраженияСПсевдонимом", ТекстВыраженияСПсевдонимом);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстУсловия", ТекстУсловия);
		ТекстыЗапросов.Добавить(ТекстЗапроса);
	КонецЦикла;
	
	ТекстОшибки = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	Для Каждого ПараметрЗапроса Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);
	КонецЦикла;
	Попытка
		РезультатЗапроса = Запрос.Выполнить();
		Если Не ПустаяСтрока(НаименованиеДляПечати) Тогда
			ТаблицаРезультат = РезультатЗапроса.Выгрузить();
			НаименованиеДляПечати = ТаблицаРезультат[0][ТаблицаРезультат.Колонки[0].Имя];
		КонецЕсли;
	Исключение
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр(
			"ru='Ошибка при проверке выражения %1. Возможно используются некорректные операнды для аналитики с несколькими типами значений'"),
			ТекстВыражения);
	КонецПопытки;
	
	Возврат ТекстОшибки;
	
КонецФункции

#КонецОбласти
